{
    "descriptions": {
        "abande": "Abande is the second game in Dieter Stein's stacking trilogy. Place or move pieces and stacks to generate the highest score you can whilst always keeping the board connected. The square, snubsquare, and hex boards are available.",
        "accasta": "Accasta is the first of Dieter Stein's stacking trilogy. The goal is to get three of your own stacks into the enemy's castle area. There are three different types of pieces in the base version. In the \"Pari\" variant, movement is determined by how many friendly pieces are in the stack.",
        "amazons": "A two-player game played on a 10x10 board. Each player has four queens (the eponymous amazons). Each turn, you move one of the queens and then shoot an arrow from your final square. The arrow causes that square to become blocked for the rest of the game. Queens and arrows cannot cross blocked squares or squares occupied by other queens. The winner is the last person who is able to move.",
        "archimedes": "A game based on the legend of Archimedes teaching the Syracuse soldiers how to focus the sun's rays with their shields to set ships on fire. The goal is to begin your turn with a piece in your enemy's port. At the end of each turn, any enemy ships in sight of three of your pieces are destroyed by fire. Destroyed ships can eventually be rebuilt.",
        "attangle": "Attangle is the final entry in Dieter Stein's stacking trilogy. Place and move pieces to build stacks. First person to build three triple stacks wins. The \"Grand Attangle\" variant is also implemented.",
        "blam": "An Icehouse game for 2–4 players played on a standard chess board. Pieces placed push adjacent pieces away. Push pieces off the board to capture them. Whoever has captured the highest pip total of pieces at the end of the game wins.",
        "breakthrough": "One of the simplest \"get to your opponent's home row\" games around. Pieces move and capture like chess pawns. First to the other home row wins. Also includes a \"Bombardment\" variant where instead of regular capture moves, one can detonate a piece, which destroys it and all pieces around it.",
        "cannon": "A two-player game played on a 10x10 board. Soldiers can move independently, but three soldiers in a row form a \"cannon\" and can move along their length or kill soldiers two or three spaces away. The first player to capture the opposing town wins.",
        "ceph": "A two-player game of area control by capture using dice. The goal is to fill a board with as many of your dice as possible. This is complicated by a capturing mechanic that keeps the board in constant flux. The game ends when the board has been completely filled. Draws are not possible.\n\nThe default board is a 5x5 square. Only orthogonal connections are counted. A 5x5 snubsquare board is also available, with all connections active.",
        "chase": "Chase is a unique move and capture game played on a cylindrical hex board with dice. Pieces move the exact number of spaces showing on the die face (its \"speed\"). Landing on enemy pieces captures them; landing on friendly pieces bumps them, which can cause chain reactions. The chamber in the centre of the board is a way of gaining more pieces. You must maintain a total of 25 speed throughout the game. Once you are no longer able to do that, you lose.",
        "dipole": "An anti-race game where you inexorably lose pieces, but you try to be the last one to run out.",
        "entropy": "Entropy is a 2-player game representing the struggle between Order and Chaos. The Order player tries to organize their board in such a way to score the highest amount. Chaos, of course, attempts to thwart Order whenever possible.\n\nThis implementation provides a simultaneous environment where each player has their own Order board. Each player places a piece on their opponent's Order board and then makes a move on their own board, players acting as both Order and Chaos at the same time. The player with the greatest score wins! Since both players share the same randomized pool of pieces, this approach gives the cleanest measure of skill.",
        "epam": "Epaminondas is an elegant 2-player game in which you try to overwhelm your opponent's home row. Pieces move as phalanxes a number of spaces up to their length. The rules are exceedingly simple, but the result is something deep and complex.",
        "fabrik": "In Fabrik, players manipulate workers to determine where pieces can be placed. The goal is to get a certain number of your pieces in a row. In the default game, players can move either worker. The \"Arbeiter\" variant gives each player control over a specific worker.",
        "fendo": "In Fendo, players manoeuvre their pieces to build fences, eventually creating closed off areas that hopefully only they control. Once all the pieces are isolated, the player who controls the most area wins.",
        "homeworlds": "An Icehouse game for 2 to 4 players. Players are interstellar civilizations vying for domination. Each of the four colours of pyramid gives access to different actions. Amass a fleet, explore the galaxy, and ultimately destroy your opponents.\n\nBecause the open nature of the Abstract Play service makes hidden information challenging, the good and evil mechanic of the original rules is not supported. The win condition is instead what's called \"Sinister Homeworlds.\" You only win by defeating the opponent to your left. If someone else does that, the game continue, but your left-hand opponent now shifts clockwise.",
        "loa": "A classic game where you try to gather all your pieces into a single connected group. Pieces can only move the exact number of spaces as the number of pieces that lie along the line of movement. This implementation uses a 9x9 board and has a \"black hole\" in the centre of it. Landing on the black hole means the piece is removed from the game. Simultaneous connections are scored as a draw. The \"Scrambled Eggs\" initial layout variant is supported.",
        "manalath": "Manalath is a game on a hexagonal grid where you can place pieces of either colour. You win if at the end of your turn there's a group of five pieces of your colour, but you *lose* if there's a group of four stones of your colour. How are you going to do that?!",
        "mchess": "A Looney pyramid game for two players played on half of a standard chess board. It is a chess-like strategy game in which location, rather than piece color, determines which pieces you may move. Like Chess, each type of piece has its own way of moving, and you capture by moving onto an opponent's square; but unlike Chess, you can only move pieces sitting in your own quadrant, and only attack those in other quadrants, which may include your own former pieces. The game ends when someone runs out of pieces, and the winner is the player who captured the most points. A variant called \"Of Knights and Kings\" changes the way Pawns and Drones move to create a very different strategic game.\n\nWhile the game is playable by four players (or different numbers with odd-shaped boards), this implementation only supports two players.",
        "monkey": "You start with a single queen, composed of a stack of checkers. When you make noncapturing moves, the queen leaves a singleton behind. Queens and singletons move and capture like chess queens. To win, capture the opposing queen or leave them with no legal moves.",
        "mvolcano": "An Icehouse puzzle game for 2 players. Stacks of pyramids are volcanos, some of which are capped. As you move caps around, you cause eruptions that may lead to you capturing pieces. This is an older version of the game. It is played on a 6x6 board, and the game ends as soon as someone captures at least one piece of each colour or all three white pieces. Scores are then calculated. Highest score wins.",
        "ordo": "Ordo is a \"get to your opponent's home row\" game in which you must always keep your pieces connected. Pieces can move singly and also as a group in certain situations. You can also win by breaking up your opponent's group in such a way that they can't reconnect it.",
        "pikemen": "A Looney pyramid game where the pyramids represents soldiers with long pikes. Pieces charge in the direction they're facing and can then change their orientation. Capture a certain number of enemy soldiers to win.\n\nWhile the game is technically playable by three and four players, this implementation only supports two players.",
        "taiji": "Two players take turns placing one piece of each colour next to each other. The winner is the one who forms the largest orthogonal groups of their own colour.\n\n**Variants**\n\n- The default board size is 9x9, but 7x7 and 11x11 versions are also available.\n- The default win condition is the size of your two largest groups, but at the beginning of the game you can agree on looking at only one or three groups.\n- The default rule is no diagonal placement. The \"Tonga\" variant allows it, however.",
        "urbino": "In Urbino, one manipulates architects (like in the game Fabrik) to build districts of different building types according to a handful of placement rules. When no more moves are possible, districts are scored, and the highest score wins. Also includes the \"Monuments\" variant.",
        "volcano": "An Icehouse puzzle game for 2 players. Stacks of pyramids are volcanos, some of which are capped. As you move caps around, you cause eruptions that may lead to you capturing pieces. The winner is the first to capture a certain number of trios.",
        "wyke": "A two-player game where one plays the builder and the other the destroyer. Claim cells by either completing or completely destroying lots. Win a certain number of lots or lots in a particular pattern to win.",
        "zola": "A game where your movement is constrained by your distance from the centre of the board. Capturing moves must not increase that distance. Non-capturing moves must increase that distance. First person to capture all opposing pieces wins."
    },
    "homeworlds": {
        "CMD_ATK_OWNER": "In games with more than two players, you have to always specify the owner of the ship you are attacking.",
        "CMD_ATK_SELF": "You may not attack yourself.",
        "CMD_ATK_SIZE": "You don't have a ship large enough to attack the ship {{target}}.",
        "CMD_BUILD_TEMPLATE": "You do not have a model from which to build a new ship.",
        "CMD_CATA_ACTIONS": "You may not trigger a catastrophe while you still have actions to use.",
        "CMD_CATA_INVALID": "There is no overpopulation of {{colour}} in the {{system}} system.",
        "CMD_DISC_DOUBLE": "A system by the name {{name}} has already been charted.",
        "CMD_HOME_COLOURS": "You're requesting a home world with fewer than three technologies available. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_DOUBLE": "You already have a home world.",
        "CMD_HOME_RHO": "You're requesting a home world with the same star sizes as your right-hand opponent. This puts your nemesis only one jump away from you! If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_SAMESIZE": "You're requesting a home world with two stars of the same size. This puts you at a strong disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_SINGLE": "You're requesting a home world with only one star. This puts you at a strong disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_SMALLSHIP": "You are requesting a home world without a large ship. This puts you at a disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_TECHS": "You're requesting a home world that does not contain Green or Blue technologies. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_MOVE_CONNECTION": "The systems {{from}} and {{to}} are not connected. You can only travel between systems that do not share any of the same-sized stars.",
        "CMD_NOACTIONS": "You have no actions remaining.",
        "CMD_NOACTIONS_B": "You have no more trade actions remaining.",
        "CMD_NOACTIONS_G": "You have no construction actions remaining.",
        "CMD_NOACTIONS_R": "You do not have any attack actions remaining.",
        "CMD_NOACTIONS_Y": "You have no movement actions remaining.",
        "CMD_NOSYSTEM": "Could not find a system with the name {{system}}.",
        "CMD_NOTECH_B": "You do not have access to refurbishers (BLUE) in this system.",
        "CMD_NOTECH_G": "You do not have access to shipyards (GREEN) in this system.",
        "CMD_NOTECH_R": "You do not have access to weapons technology (RED) in this system.",
        "CMD_NOTECH_Y": "You do not have access to propulsion technology (YELLOW) in this system.",
        "CMD_PARAMETERS": "The wrong number of parameters were provided.",
        "CMD_PASS_FREE": "You may not pass your free action.",
        "CMD_PASS_TOOMANY": "You tried to pass more actions than you have remaining.",
        "CMD_STARSHIP_NAME": "The following ship/star designation could not be understood: {{arg}}.",
        "CMD_TRADE_DOUBLE": "You can't trade a ship for one of the same colour.",
        "MOVE_MOREACTIONS": "You still have actions to spend.",
        "MOVE_SELFELIMINATE": "You may not eliminate yourself.",
        "MOVE_UNRECOGNIZED": "Unrecognized command: {{cmd}}.",
        "STASH_EMPTY": "The stash has no more {{colour}} pieces left.",
        "SYSTEM_BADNAME": "The system name you requested ({{name}}) is invalid. Names may be no longer than 25 characters, must start with a letter or a number, and may only contain numbers, letters, hyphens, and underscores. No spaces are allowed.",
        "SYSTEM_FULL": "The {{system}} system is full. Home systems can only accommodate 16 ships. Periphery systems can accommodate 24.",
        "SYSTEM_NOSHIP": "Could not find the ship {{ship} in the {{system}} system."
    },
    "INITIAL_UNDO": "You can't undo the initial starting position of the game.",
    "MOVES_GAMEOVER": "You cannot make moves in concluded games",
    "MOVES_INVALID": "The move '{{move}}' is invalid. Please check the rules and try again.",
    "MOVES_SIMULTANEOUS_PARTIAL": "In simultaneous games, both players' moves must be submitted at the same time.",
    "status": {
        "PHASE": "Phase",
        "SCORES": "Scores",
        "TERRITORY": "Territory",
        "DISTANCES": "Distances",
        "PIECESINHAND": "Pieces in hand",
        "PIECESREMAINING": "Pieces remaining",
        "TOPLACE": "Piece to place",
        "amazons": {
            "ISOLATEDQUEENS": "The queens are now isolated",
            "TERRITORY": "Territory"
        },
        "blam": {
            "NUMPIECES": "{{count}} pieces"
        },
        "chase": {
            "BALANCE": "Imbalance",
            "IMBALANCE": "Current player is imbalanced by {{delta}} speed."
        },
        "entropy": {
            "CHAOS": "Chaos",
            "ORDER": "Order"
        }
    },
    "validation": {
        "_general": {
            "CAPTURE4MOVE": "You signalled a capture, but there's no piece at {{where}}.",
            "DEFAULT_HANDLER": "This is the default handler and should never be called directly. Please inform the administrator.",
            "FAILSAFE": "The move '{{move}}' passed validation but does not appear to be legal. Please inform the administrator.",
            "GENERIC": "A generic error occured while processing your click:\nError message: {{emessage}}\nStack: {{estack}}\nMove: {{move}}, Row: {{row}}, Col: {{col}}, Index: {{index}}",
            "INVALIDCELL": "Could not find the cell '{{cell}}' on the board.",
            "MOVE4CAPTURE": "You signalled a regular move, but {{where}} is occupied.",
            "NO_MOVES": "The piece at {{where}} does not have any legal moves.",
            "NOLOS": "There is no line of sight between {{from}} and {{to}}.",
            "NONEXISTENT": "Trying to interact with a piece or stack that doesn't exist at {{where}}.",
            "NOPIECES": "You have no pieces to place.",
            "OBSTRUCTED": "There is an obstruction at {{obstruction}} between {{from}} and {{to}}.",
            "OCCUPIED": "The cell {{where}} is already occupied.",
            "SAME_FROM_TO": "The 'from' and 'to' cells have to be different.",
            "SELFCAPTURE": "You cannot capture your own pieces.",
            "UNCONTROLLED": "You cannot move pieces you don't control.",
            "VALID_MOVE": "Looks like a valid move.",
            "INVALID_MOVE": "'{{move}}' doesn't look like a valid move.",
            "INCOMPLETE_MOVE": "This move looks incomplete."
        },
        "abande": {
            "DISCONNECTEDMOVE": "A move from {{from}} to {{to}} would disconnect the band.",
            "DISCONNECTEDPLACE": "Placing a piece at {{where}} would disconnect the band.",
            "INITIAL_INSTRUCTIONS": "Place a piece on an empty space connected to the other pieces.",
            "INVALIDPASS": "You cannot pass while you have pieces in hand.",
            "MOVE2CONTROLLED": "You cannot capture your own stacks.",
            "MOVE2EMPTY": "You cannot move to empty spaces.",
            "PARTIAL": "It's possible you're trying to move a stack. Provide the destination.",
            "TOOEARLY": "You cannot move until the first player has placed two pieces.",
            "TOOHIGH": "Moving from {{from}} to {{to}} would result in a stack taller than three pieces high.",
            "TRIPLESTACK": "You cannot move triple stacks."
        },
        "accasta": {
            "INITIAL_INSTRUCTIONS": "Select the bottom piece of the substack you wish to move.",
            "INVALID_SIZE": "In the move '{{move}}', the step '{{step}}' contains an invalid number of pieces to move. Remember that if you're removing the entire stack, omit the number altogether.",
            "MORE_THAN_THREE": "In the move '{{move}}', the step '{{step}}' would create a stack with more than 3 pieces of the same color.",
            "PARTIAL_FULLSTACK": "Looks like you want to move an entire stack. Provide the destination.",
            "PARTIAL_SUBSTACK_one": "Looks like you want to move the top piece from the stack. Provide the destination.",
            "PARTIAL_SUBSTACK_other": "Looks like you want to move the top {{count}} pieces from the stack. Provide the destination.",
            "SOURCE_EMPTY": "In the move '{{move}}', when you come to the step '{{step}}', you don't have any pieces left to move.",
            "TOOFAR": "In the move '{{move}}', the step '{{step}}' tries to move further than it is allowed.",
            "TOOHIGH": "In the move '{{move}}', the step '{{step}}' would create a stack greater than six pieces high.",
            "USEPLUS": "In the step {{step}}, use a plus sign when moving onto an existing stack.",
            "USEMINUS": "In the step {{step}}, use a minus sign when moving onto an empty cell."
        },
        "amazons": {
            "INITIAL_INSTRUCTIONS": "Select one of your amazons to move.",
            "POTENTIAL_BLOCK": "So far so good. Provide the space you want to block.",
            "POTENTIAL_MOVE": "So far so good. Provide the space you want to move to.",
            "STRAIGHTLINE": "You can only move and block in straight lines."
        },
        "archimedes": {
            "INITIAL_INSTRUCTIONS": "Select a piece to move, or click on your home port to rebuild a destroyed ship.",
            "MUST_MOVE": "Ships must move at least one space.",
            "PARTIAL": "Select a destination.",
            "SELF_OCCUPATION": "You may not leave your own pieces on your home port."
        },
        "attangle": {
            "EMPTYCAPTURE": "One of the cells involved with the capture doesn't have any pieces in it.",
            "INITIAL_INSTRUCTIONS": "Place a piece on an empty cell (that doesn't have a dot on it) or select an existing piece to start a capture.",
            "MOVE2EMPTY": "You cannot capture empty cells.",
            "ONVOID": "You cannot place pieces on voids (the spaces marked with a black dot).",
            "POTENTIAL_ONE": "This could potentially be a capture. Provide the location of the second stack.",
            "POTENTIAL_TWO": "This could potentially be a capture. Provide the target location.",
            "TOOHIGH": "The combined stack after the capture will be too high.",
            "TRIPLESTACK": "Triple stacks cannot participate in captures."
        },
        "blam": {
            "BADSYNTAX": "Invalid syntax: {{move}}. It should be the number 1, 2, or 3 followed by an empty cell (e.g., 1e4, or 3b2).",
            "INITIAL_INSTRUCTIONS": "Enter the size of the piece to place. You can click on your stash.",
            "MOVES_NOPASS": "You cannot pass while you have pieces to place.",
            "NOPIECE": "You do not have a piece of size {{size}} to place.",
            "PARTIAL": "Provide the destination.",
            "SIZEFIRST": "First provide the size of the piece to place. You can click on your stash."
        },
        "breakthrough": {
            "BADVARIANT": "Bombardment moves are only allowed when that variant is active.",
            "DIAGONAL_CAPTURES": "Captures may only be made in a forward-diagonal direction.",
            "INITIAL_INSTRUCTIONS": "Select one of your pawns.",
            "NOCAPTURES": "Captures are not allowed in the 'Bombardment' variant.",
            "ONLY_FORWARD": "Pieces may only move forward.",
            "PARTIAL": "Provide the destination.",
            "TOOFAR": "Pieces can only move one space at a time."
        },
        "cannon": {
            "BAD_RETREAT": "Pieces can only retreat if they are adjacent to at least one enemy piece.",
            "FIXED_TOWNS": "Towns cannot be moved.",
            "FORWARD_ONLY": "Pieces can only move forward, unless capturing laterally or retreating.",
            "HOMECELL": "You can only place your town on your home row, and not on the corners.",
            "INITIAL_INSTRUCTIONS_placed": "Select one of your soldiers to move or an enemy piece to capture by cannon fire.",
            "INITIAL_INSTRUCTIONS_towns": "Select a cell along the back row to place your town.",
            "LATERAL_MOVEMENT": "Pieces can only move laterally when capturing.",
            "NOCANNON_CAPTURE": "This piece is not in range of any of your cannons.",
            "NOCANNON_MOVE": "There is no cannon along which to move that piece that way.",
            "PARTIAL": "Provide a destination.",
            "RETREAT_DISTANCE": "You must retreat two full spaces.",
            "TOOFAR": "You can only move one space at a time, unless retreating.",
            "UNCONTROLLED": "You can't control enemy pieces. If you're trying to capture it by cannon, click it again."
        },
        "ceph": {
            "DUPLICATECAP": "You can't capture the same piece more than once.",
            "INITIAL_INSTRUCTIONS": "Select an empty cell.",
            "NOTADJACENT": "You can only capture pieces orthogonally adjacent to your placed piece.",
            "PARTIAL_ONECAP": "Select at least one more adjacent piece to capture.",
            "PARTIAL_PRECAP": "Select a piece to capture.",
            "TOOHIGH": "The pieces you capture cannot total more than six."
        },
        "chase": {
            "MUST_BALANCE": "You are imbalanced. Your move must begin with a '{'.",
            "NO_BALANCE": "You are not imbalanced, your move can not begin with a '{'.",
            "NO_BALANCE_LEFT": "You don't have any balance left to distribute to {{where}}.",
            "BALANCE_LOWEST": "When balancing you must select one of the pieces with the lowest speed. The piece at {{where}} is not one of those.",
            "DISTANT_EXCHANGE": "The cells {{left}} and {{right}} are not adjacent to each other.",
            "INITIAL_INSTRUCTIONS_balanced": "Select a piece to move. To start an exchange select the piece from which you want to remove speed, twice.",
            "INITIAL_INSTRUCTIONS_imbalanced": "You are imbalanced by {{delta}} speed. Select on of your pieces with the lowest speed to correct.",
            "MULTIPLE_PATHS": "There is more than one way to get to {{to}} from {{from}}. Please edit the move box to add a compass direction or choose the exact move from the drop-down menu.",
            "INVALID_SPEED": "The speed {{speed}} is not valid for {{cell}}. It must be between 1 and 6.",
            "NOCHANGE_EXCHANGE": "Exchanges must result in a change in the board state.",
            "NOPATH": "There is no path from {{from}} to {{to}}.",
            "PARTIAL_BALANCE": "You are still imbalanced by {{delta}} speed. Select another of your pieces with the lowest speed to correct.",
            "PARTIAL_BALANCE_PARENTHESIS": "Looks like a valid balance move, close the parenthesis to continue.",
            "PARTIAL_EXCHANGE": "Select another adjacent piece to make the exchange. Or click again to remove more speed.",
            "PARTIAL_MOVE": "Select a destination, or select the same piece again to begin an exchange.",
            "UNEQUAL_EXCHANGE": "Exchanges must result in the same combined speed. The original combined speed was {{original}}. Your requested move would change that to {{proposed}}."
        },
        "dipole": {
            "FORWARD": "Noncapturing movement must be in a forward direction.",
            "INITIAL_INSTRUCTIONS": "Select one of your own stacks.",
            "INVALID_PASS": "You may not pass if you have other valid moves.",
            "MERGE4CAPTURE": "You signalled a merge, but the destination is occupied by enemy pieces.",
            "MERGE4MOVE": "You signalled a merge, but the destination is empty.",
            "MOVE4MERGE": "You signalled a move, but the destination already contains some of your own pieces.",
            "PARTIAL": "Select a destination.",
            "STACK_SIZE": "You may only capture stacks of equal or smaller size.",
            "TOOFAR_edge": "The stack at {{from}} can't reach the edge from there."
        },
        "entropy": {
            "INITIAL_INSTRUCTIONS_chaos": "Select an empty cell on your opponent's board to place the next piece.",
            "INITIAL_INSTRUCTIONS_order": "Select a piece on your board to move, or pass.",
            "INVALID_MOVEMENT": "You cannot move pieces in the CHAOS phase.",
            "PARTIAL": "Select a destination.",
            "STRAIGHT_LINES": "Pieces may only be moved in straight horizontal or vertical lines."
        },
        "epam": {
            "INITIAL_INSTRUCTIONS_move": "Select the tail of the phalanx you wish to move.",
            "INITIAL_INSTRUCTIONS_stones": "Place a stone in an empty space in the middle six rows.",
            "INSUFFICIENT_FORCES": "When capturing, your phalanx must have more pieces than the captured phalanx.",
            "NOPLACEMENT": "You may only place pieces in the 'Stumbling Blocks' variant, when there are fewer than three stones already placed.",
            "PARTIAL": "Select where you want the *head* of the phalanx to end its movement.",
            "STONES": "Stones can only be placed in the middle six rows.",
            "STRAIGHTLINE": "You can only move in straight lines.",
            "TOOFAR": "The phalanx {{tail}}-{{head}} cannot move {{distance}} spaces."
        },
        "fabrik": {
            "INITIAL_INSTRUCTIONS_first": "Select a cell in sight to place a piece, or you can pass if your opponent just placed the second worker.",
            "INITIAL_INSTRUCTIONS_fresh": "Place a worker in an empty cell.",
            "INITIAL_INSTRUCTIONS_inprogress": "Select a worker to move, or select an empty cell in sight to place a piece.",
            "INVALID_PASS": "You may only pass the turn immediately after the second worker has been placed.",
            "INVALID_PLACEMENT": "The cell {{where}} is not visible to both workers.",
            "MUST_PASS_PLAY": "The first turn after the second worker has been placed must be a pass or placement.",
            "NOPLACEMENTS": "You cannot move the workers such that you have no valid placements available.",
            "PARTIAL_MOVE": "Provide the destination.",
            "PARTIAL_PLACE": "Choose a cell to place a piece in."
        },
        "fendo": {
            "DUPLICATE_FENCE": "A fence already exists between these two cells.",
            "INITIAL_INSTRUCTIONS": "Select a piece to move or an empty space to place a piece.",
            "INVALID_DESTINATION": "You cannot reach {{to}} from {{from}}. Remember that pieces can only make one ninety-degree turn as they move.",
            "INVALID_DIRECTION": "The direction {{dir}} is not valid. It must 'N', 'E', 'S', or 'W'.",
            "INVALID_FENCE": "Placing a fence here would either create an empty closed area or create multiple open areas.",
            "INVALID_PASS": "You may not pass if you have moves available.",
            "NO_EDGE_FENCES": "You may not place fences on the edge of the board.",
            "ONLY_MOVE_OPEN": "You may only move pieces in open areas.",
            "PARTIAL_FENCE": "Provide the direction where you wish to place a fence. If clicking, click on the adjacent cell you want to block.",
            "PARTIAL_MOVE": "Provide the destination.",
            "PLACE_IN_OPEN": "You may only place pieces in the open area.",
            "PLACE_IN_RANGE": "You may only place pieces that are within one regular move of an existing piece."
        },
        "homeworlds": {
            "attack": {
                "PARTIAL_NOARGS": "Select a ship to attack.",
                "PARTIAL_ONEARG": "Select the system where the ship is found."
            },
            "build": {
                "PARTIAL_NOARGS": "Select a ship colour from the global stash. The size you select doesn't matter.",
                "PARTIAL_ONEARG": "Select the system in which to place the new ship."
            },
            "catastrophe": {
                "PARTIAL_NOARGS": "Select the overpopulated system.",
                "PARTIAL_ONEARG": "Select the colour that is overpopulated."
            },
            "discover": {
                "PARTIAL_NOARGS": "Select a ship to move.",
                "PARTIAL_ONEARG": "Select the system where the ship is found.",
                "PARTIAL_THREEARGS": "Give the new system a name.",
                "PARTIAL_TWOARGS": "Select a star from the global stash."
            },
            "homeworld": {
                "PARTIAL_NOARGS": "Select your first star from the global stash.",
                "PARTIAL_ONEARG": "Select a second star from the global stash.",
                "PARTIAL_TWOARGS": "Select a colony ship from the global stash."
            },
            "INITIAL_INSTRUCTIONS_fresh": "You need to establish a homeworld. Choose a piece from the global stash to be your first star.",
            "INITIAL_INSTRUCTIONS_inprogress": "Select any ship or star to do the action of that colour, or select the \"Sacrifice\" button below the global stash.",
            "move": {
                "PARTIAL_NOARGS": "Select a ship to move.",
                "PARTIAL_ONEARG": "Select the system in which the ship is found.",
                "PARTIAL_TWOARGS": "Select the system you want to move to, or select a piece from the global stash to discover a new system."
            },
            "sacrifice": {
                "PARTIAL_NOARGS": "Select the ship to sacrifice.",
                "PARTIAL_ONEARG": "Select the system where the ship is found."
            },
            "trade": {
                "PARTIAL_NOARGS": "Select a ship to convert.",
                "PARTIAL_ONEARG": "Select the system where the ship is found.",
                "PARTIAL_TWOARGS": "Select the new colour."
            }
        },
        "loa": {
            "INITIAL_INSTRUCTIONS": "Select one of your pieces to move.",
            "NOT_IN_RANGE": "You cannot reach {{to}} from {{from}}.",
            "PARTIAL": "Select your destination."
        },
        "manalath": {
            "BAD_PASS": "You may not pass if legal moves are available.",
            "INITIAL_INSTRUCTIONS": "Select a color to place. You can type 'w' or 'b', or click on the desired color on the upper left.",
            "DESTINATION": "Now select a destination.",
            "INVALID_COLOUR": "The only valid colours are 'w' and 'b'. You gave '{{colour}}'.",
            "OVERSIZED_GROUP": "This would create a group of more than five pieces."
        },
        "mchess": {
            "INITIAL_INSTRUCTIONS": "Select a piece on your side of the board to move.",
            "INVALID_MOVE": "You're either trying to move too far or jump another piece.",
            "INVALID_PROMOTION": "Invalid field promotion. You can only promote to piece sizes you don't already control.",
            "PARTIAL": "Select a destination."
        },
        "monkey": {
            "INITIAL_INSTRUCTIONS": "Select one of your pieces.",
            "MOVE_CLOSER": "When singletons make noncapturing moves, they must move closer to the enemy queen (straight-line distance).",
            "PARTIAL": "Select a destination.",
            "QUEEN_DEPLETED": "Your queen can no longer make noncapturing moves."
        },
        "mvolcano": {
            "INITIAL_INSTRUCTIONS": "Select a cap to move."
        },
        "ordo": {
            "DISCONNECTED": "That move would leave your pieces disconnected.",
            "DISORGANIZED": "Moves must be \"organized,\" meaning that the destination cell must be orthogonal to the first cell in the ordo.",
            "INITIAL_INSTRUCTIONS": "Select one of your pieces to move or start an ordo.",
            "INVALID_ORDO": "The ordo '{{ordo}}' is not valid. Ordos are groups of pieces connected in a straight, orthogonal line.",
            "INVALID_ORDO_MOVE": "The ordo '{{ordo}}' cannot move to {{destination}}. This is usually because of an obstruction.",
            "PARTIAL": "Select a destination or select a second piece to form an ordo.",
            "WRONG_DIRECTION": "You may only move forward or side-to-side unless your pieces are disconnected."
        },
        "pikemen": {
            "BAD_FACING": "The following move segment had an unrecognizeable facing: {{segment}}.",
            "INITIAL_INSTRUCTIONS": "Select one of your pieces to move.",
            "PARTIAL_FINAL": "The move is valid. If you wish to reorient one last time, click on the cell you want to point towards, or click on the piece itself to stand upright.",
            "PARTIAL_ORIENT": "Select the cell you want to point the piece towards.",
            "PARTIAL_PREMOVE": "Select a destination, or select the piece again to reorient.",
            "TOOSMALL": "Upright pieces can only be captured by larger pieces.",
            "UPRIGHT_MOVEMENT": "Upright pieces cannot move.",
            "USELESS_ORIENTATION": "If you reorient, you have to change to a new facing."
        },
        "taiji": {
            "ADJACENT": "Pieces must be placed adjacent to each other. Diagonal placement is only permitted in the \"Tonga\" variant.",
            "INITIAL_INSTRUCTIONS": "Place a light piece in an empty space.",
            "PARTIAL": "Place the dark piece in an adjacent empty space."
        },
        "urbino": {
            "INITIAL_INSTRUCTIONS_first": "Select a cell in sight to place a piece, or you may pass if your opponent just placed the second architect.",
            "INITIAL_INSTRUCTIONS_fresh": "Place an architect in an empty cell.",
            "INITIAL_INSTRUCTIONS_inprogress": "Select an architect to move or select the size of a piece to place.",
            "INVALID_PASS": "You may only pass if you have no other moves available.",
            "INVALID_PLACE_CELL": "The cell {{where}} is not visible to both architects.",
            "INVALID_PLACE_PIECE": {
                "house": "You may not place a house here because it would create multiple blocks of one colour.",
                "palace": "You may not place a palace here either because there is a palace adjacent or it would create multiple blocks of one colour.",
                "tower": "You may not place a tower here either because there is a tower adjacent or it would create multiple blocks of one colour."
            },
            "MUST_PASS_PLAY": "The first turn after the second worker has been placed must be a pass or placement.",
            "NOPLACEMENTS": "You cannot move the workers such that you have no valid placements available.",
            "PARTIAL_MOVE": "Provide the destination.",
            "PARTIAL_PLACE_SIZE": "Select the size of a piece to place.",
            "PARTIAL_PLACE": "Choose a cell to place a piece in."
        },
        "volcano": {
            "BAD_FROM": "{{from}} doesn't look like a position on the board, or a piece in your stash.",
            "INITIAL_INSTRUCTIONS": "Select a cap to move or a piece from your captured pile to place on the board.",
            "MOVES_AFTER_ERUPTION": "You may not continue moving after causing an eruption.",
            "MOVES_CAPS_ONLY": "You may only move caps.",
            "MOVES_DOUBLE_CAP": "Nothing may be placed on top of a cap.",
            "MOVES_MUST_ERUPT": "You must continue moving until you cause an eruption.",
            "MOVES_NOPIECE": "You don't have a {{piece}} piece in your stash to place.",
            "MOVES_ONE_POWERPLAY": "You may only make one power play per turn.",
            "MOVES_ONE_SPACE": "Caps may only be moved one space at a time.",
            "PARTIAL_ERUPTION": "Keep moving caps until you cause an eruption.",
            "PARTIAL_MOVE": "Select the destination."
        },
        "wyke": {
            "CELL_CLAIMED": "The cell {{cell}} has already been claimed and cannot be interacted with further.",
            "DUPLICATE_CELLS": "You can't select the same cell multiple times.",
            "INITIAL_INSTRUCTIONS": "Select an available move from the button bar.",
            "INVALID_FORMAT": "Your move is in an invalid format: \"{{move}}\". It should start with the move type followed by a list of cells in parentheses (e.g., \"3-1 (a1,b2)\").",
            "INVALID_MOVETYPE": "The move \"{{move}}\" is not one of the five allowed movement types.",
            "MOVETYPE_UNAVAILABLE": "That move type is unavailable. Only select moves that are not stricken through.",
            "PARTIAL": "Continue selecting cells until the move is complete.",
            "TOO_FEW_PIECES": "There are too few pieces at {{where}} to remove {{num}} of them.",
            "TOO_MANY_CELLS": "You have selected more cells than the move type allows.",
            "TOO_MANY_PIECES": "There are too many pieces at {{where}} to add {{num}} more."
        },
        "zola": {
            "DISTANCE_CAPTURES": "Capture moves must not increase your distance from the centre.",
            "DISTANCE_NONCAPTURES": "Non-capture moves must increase your distance from the centre.",
            "INITIAL_INSTRUCTIONS": "Select one of your own pieces.",
            "PARTIAL": "Select a destination."
        }
    },
    "variants": {
        "abande": {
            "hex": {
                "name": "Board: Hexagonal",
                "description": "A 37-space hexagonal board."
            },
            "snub": {
                "name": "Board: Snub Square",
                "description": "A hybrid orthogonal/hexagonal board shape with unique connection characteristics."
            }
        },
        "accasta": {
            "pari": {
                "name": "Accasta Pari",
                "description": "Instead of having individual piece types, pieces move depending on how many friendly pieces are in the stack. The top piece of a stack with three of your pieces will move like a chariot, two pieces like a horse, and one piece like a shield."
            }
        },
        "attangle": {
            "grand": {
                "name": "Grand Attangle",
                "description": "Played on a larger board, with more voids, and the goal now is to create five triple stacks."
            }
        },
        "breakthrough": {
            "bombardment": {
                "name": "Bombardment",
                "description": "Instead of regular capture moves, you can detonate a piece, which destroys it and any pieces immediately surrounding it."
            }
        },
        "ceph": {
            "snub": {
                "name": "Board: Snub Square",
                "description": "A hybrid orthogonal/hexagonal board shape with unique connection characteristics."
            }
        },
        "dipole": {
            "international": {
                "name": "Larger board: 10x10"
            }
        },
        "epam": {
            "stones": {
                "name": "Stumbling Blocks",
                "description": "In this variant, the players place three impassable stones in the middle of the board."
            }
        },
        "fabrik": {
            "arbeiter": {
                "name": "Arbeiter",
                "description": "Each player controls one worker and cannot move the other. The victory condition is comensurately reduced to three pieces in a row instead of four."
            }
        },
        "loa": {
            "scrambled": {
                "name": "Scrambled Eggs",
                "description": "Pieces are interspersed with each other instead of starting together on opposite sides of the board."
            }
        },
        "mchess": {
            "ofkk": {
                "name": "Of Knights and Kings",
                "description": "Pawns move like Chess kings, and drones move like Chess knights."
            }
        },
        "pikemen": {
            "15pts": {
                "name": "Longer Game: 15 points",
                "description": "The game doesn't end until you have 15 points worth of enemy soldiers."
            }
        },
        "taiji": {
            "7x7": {
                "name": "Smaller board: 7x7"
            },
            "11x11": {
                "name": "Larger board: 11x11"
            },
            "onegroup": {
                "name": "Scoring: Single largest group"
            },
            "threegroups": {
                "name": "Scoring: Largest three groups"
            },
            "tonga": {
                "name": "Tonga (Diagonal Placement)"
            }
        },
        "urbino": {
            "monuments": {
                "name": "Monuments",
                "description": "Monuments are combinations of specific pieces in a row. Each district will score the most valuble monument present for each colour. Most valuable monument becomes the first tie breaker in districts, but not when breaking end-of-game ties."
            }
        },
        "wyke": {
            "6x6": {
                "name": "Larger board: 6x6"
            }
        },
        "zola": {
            "8x8": {
                "name": "Larger board: 8x8"
            }
        }
    }
}
