{
    "homeworlds": {
        "CMD_ATK_OWNER": "In games with more than two players, you have to always specify the owner of the ship you are attacking.",
        "CMD_ATK_SELF": "You may not attack yourself.",
        "CMD_ATK_SIZE": "You don't have a ship large enough to attack the ship {{target}}.",
        "CMD_BUILD_TEMPLATE": "You do not have a model from which to build a new ship.",
        "CMD_CATA_ACTIONS": "You may not trigger a catastrophe while you still have actions to use.",
        "CMD_CATA_INVALID": "There is no overpopulation of {{colour}} in the {{system}} system.",
        "CMD_DISC_DOUBLE": "A system by the name {{name}} has already been charted.",
        "CMD_HOME_COLOURS": "You're requesting a home world with fewer than three technologies available. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_DOUBLE": "You already have a home world.",
        "CMD_HOME_RHO": "You're requesting a home world with the same star sizes as your right-hand opponent. This puts your nemesis only one jump away from you! If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_SAMESIZE": "You're requesting a home world with two stars of the same size. This puts you at a strong disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_SINGLE": "You're requesting a home world with only one star. This puts you at a strong disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_SMALLSHIP": "You are requesting a home world without a large ship. This puts you at a disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_TECHS": "You're requesting a home world that does not contain Green or Blue technologies. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_MOVE_CONNECTION": "The systems {{from}} and {{to}} are not connected. You can only travel between systems that do not share any of the same-sized stars.",
        "CMD_NOACTIONS": "You have no actions remaining.",
        "CMD_NOACTIONS_B": "You have no more trade actions remaining.",
        "CMD_NOACTIONS_G": "You have no construction actions remaining.",
        "CMD_NOACTIONS_R": "You do not have any attack actions remaining.",
        "CMD_NOACTIONS_Y": "You have no movement actions remaining.",
        "CMD_NOSYSTEM": "Could not find a system with the name {{system}}.",
        "CMD_NOTECH_B": "You do not have access to refurbishers (BLUE) in this system.",
        "CMD_NOTECH_G": "You do not have access to shipyards (GREEN) in this system.",
        "CMD_NOTECH_R": "You do not have access to weapons technology (RED) in this system.",
        "CMD_NOTECH_Y": "You do not have access to propulsion technology (YELLOW) in this system.",
        "CMD_PARAMETERS": "The wrong number of parameters were provided.",
        "CMD_PASS_FREE": "You may not pass your free action.",
        "CMD_PASS_TOOMANY": "You tried to pass more actions than you have remaining.",
        "CMD_STARSHIP_NAME": "The following ship/star designation could not be understood: {{arg}}.",
        "CMD_TRADE_DOUBLE": "You can't trade a ship for one of the same colour.",
        "MOVE_MOREACTIONS": "You still have actions to spend.",
        "MOVE_SELFELIMINATE": "You may not eliminate yourself.",
        "MOVE_UNRECOGNIZED": "Unrecognized command: {{cmd}}.",
        "STASH_EMPTY": "The stash has no more {{colour}} pieces left.",
        "SYSTEM_BADNAME": "The system name you requested ({{name}}) is invalid. Names may be no longer than 25 characters, must start with a letter or a number, and may only contain numbers, letters, hyphens, and underscores. No spaces are allowed.",
        "SYSTEM_FULL": "The {{system}} system is full. Home systems can only accommodate 16 ships. Periphery systems can accommodate 24.",
        "SYSTEM_NOSHIP": "Could not find the ship {{ship} in the {{system}} system."
    },
    "INITIAL_UNDO": "You can't undo the initial starting position of the game.",
    "MOVES_GAMEOVER": "You cannot make moves in concluded games",
    "MOVES_INVALID": "The move '{{move}}' is invalid. Please check the rules and try again.",
    "MOVES_SIMULTANEOUS_PARTIAL": "In simultaneous games, both players' moves must be submitted at the same time.",
    "validation": {
        "_general": {
            "CAPTURE4MOVE": "You signalled a capture, but there's no piece at {{where}}.",
            "DEFAULT_HANDLER": "This is the default handler and should never be called directly. Please inform the administrator.",
            "EMPTYSTRING": "No input provided to validate.",
            "FAILSAFE": "The move '{{move}}' passed validation but does not appear to be legal. Please inform the administrator.",
            "GENERIC": "A generic error occured while processing your click:\nError message: {{emessage}}\nMove: {{move}}, Row: {{row}}, Col: {{col}}, Index: {{index}}",
            "INVALIDCELL": "Could not find the cell {{cell}} on the board.",
            "MOVE4CAPTURE": "You signalled a regular move, but {{where}} is occupied.",
            "NOLOS": "There is no line of sight between {{from}} and {{to}}.",
            "NONEXISTENT": "Trying to interact with a piece or stack that doesn't exist at {{where}}.",
            "NOPIECES": "You have no pieces to place.",
            "OBSTRUCTED": "There is an obstruction at {{obstruction}} between {{from}} and {{to}}.",
            "OCCUPIED": "The cell {{where}} is already occupied.",
            "SAME_FROM_TO": "The 'from' and 'to' cells have to be different.",
            "SELFCAPTURE": "You cannot capture your own pieces.",
            "UNCONTROLLED": "You cannot move pieces you don't control.",
            "VALID_MOVE": "Looks like a valid move."
        },
        "abande": {
            "DISCONNECTEDMOVE": "A move from {{from}} to {{to}} would disconnect the band.",
            "DISCONNECTEDPLACE": "Placing a piece at {{where}} would disconnect the band.",
            "INVALIDPASS": "You cannot pass while you have pieces in hand.",
            "MOVE2CONTROLLED": "You cannot capture your own stacks.",
            "MOVE2EMPTY": "You cannot move to empty spaces.",
            "PARTIAL": "It's possible you're trying to move a stack. Provide the destination.",
            "TOOEARLY": "You cannot move until the first player has placed two pieces.",
            "TOOHIGH": "Moving from {{from}} to {{to}} would result in a stack taller than three pieces high.",
            "TRIPLESTACK": "You cannot move triple stacks."
        },
        "accasta": {
            "INVALID_SIZE": "In the move '{{move}}', the step '{{step}}' contains an invalid number of pieces to move. Remember that if you're removing the entire stack, omit the number altogether.",
            "PARTIAL_FULLSTACK": "Looks like you want to move an entire stack. Provide the destination.",
            "PARTIAL_SUBSTACK_one": "Looks like you want to move the top piece from the stack. Provide the destination.",
            "PARTIAL_SUBSTACK_other": "Looks like you want to move the top {{count}} pieces from the stack. Provide the destination.",
            "SOURCE_EMPTY": "In the move '{{move}}', when you come to the step '{{step}}', you don't have any pieces left to move.",
            "TOOFAR": "In the move '{{move}}', the step '{{step}}' tries to move further than it is allowed.",
            "TOOHIGH": "In the move '{{move}}', the step '{{step}}' would create a stack greater than six pieces high.",
            "MORE_THAN_THREE": "In the move '{{move}}', the step '{{step}}' would create a stack with more than 3 pieces of the same color."
        },
        "amazons": {
            "POTENTIAL_BLOCK": "So far so good. Provide the space you want to block.",
            "POTENTIAL_MOVE": "So far so good. Provide the space you want to move to.",
            "STRAIGHTLINE": "You can only move and block in straight lines."
        },
        "attangle": {
            "EMPTYCAPTURE": "One of the cells involved with the capture doesn't have any pieces in it.",
            "MOVE2EMPTY": "You cannot capture empty cells.",
            "ONVOID": "You cannot place pieces on voids (the spaces marked with a black dot).",
            "POTENTIAL_ONE": "This could potentially be a capture. Provide the location of the second stack.",
            "POTENTIAL_TWO": "This could potentially be a capture. Provide the target location.",
            "TOOHIGH": "The combined stack after the capture will be too high.",
            "TRIPLESTACK": "Triple stacks cannot participate in captures."
        },
        "blam": {
            "BADSYNTAX": "Invalid syntax: {{move}}. It should a the number 1, 2, or 3 followed by an empty cell (e.g., 1e4, or 3b2).",
            "MOVES_NOPASS": "You cannot pass while you have pieces to place.",
            "NOPIECE": "You do not have a piece of size {{size}} to place."
        },
        "breakthrough": {
            "BADVARIANT": "Bombardment moves are only allowed when that variant is active.",
            "DIAGONAL_CAPTURES": "Captures may only be made in a forward-diagonal direction.",
            "NOCAPTURES": "Captures are not allowed in the 'Bombardment' variant.",
            "ONLY_FORWARD": "Pieces may only move forward.",
            "PARTIAL": "Provide the destination.",
            "TOOFAR": "Pieces can only move one space at a time."
        },
        "cannon": {
            "BAD_RETREAT": "Pieces can only retreat if they are adjacent to at least one enemy piece.",
            "FIXED_TOWNS": "Towns cannot be moved.",
            "FORWARD_ONLY": "Pieces can only move forward, unless capturing laterally or retreating.",
            "HOMECELL": "You can only place your town on your home row, and not on the corners.",
            "LATERAL_MOVEMENT": "Pieces can only move laterally when capturing.",
            "NOCANNON_CAPTURE": "This piece is not in range of any of your cannons.",
            "NOCANNON_MOVE": "There is no cannon along which to move that piece that way.",
            "PARTIAL": "Provide a destination.",
            "RETREAT_DISTANCE": "You must retreat two full spaces.",
            "TOOFAR": "You can only move one space at a time, unless retreating.",
            "UNCONTROLLED": "You can't control enemy pieces. If you're trying to capture it by cannon, click it again."
        },
        "ceph": {
            "DUPLICATECAP": "You can't capture the same piece more than once.",
            "NOTADJACENT": "You can only capture pieces orthogonally adjacent to your placed piece.",
            "PARTIAL_ONECAP": "Select at least one more adjacent piece to capture.",
            "PARTIAL_PRECAP": "Select a piece to capture.",
            "TOOHIGH": "The pieces you capture cannot total more than six."
        }
    },
    "volcano": {
        "MOVES_AFTER_ERUPTION": "You may not continue moving after causing an eruption.",
        "MOVES_CAPS_ONLY": "You may only move caps.",
        "MOVES_DOUBLE_CAP": "Nothing may be placed on top of a cap.",
        "MOVES_MUST_ERUPT": "You must continue moving until you cause an eruption.",
        "MOVES_NOPIECE": "You don't have a {{piece}} piece in your stash to place.",
        "MOVES_ONE_POWERPLAY": "You may only make one power play per turn.",
        "MOVES_ONE_SPACE": "Caps may only be moved one space at a time.",
        "MOVES_TOO_FAR": "Caps may only be moved one space at a time."
    }
}
