{
    "blam": {
        "MOVES_NOPASS": "You may not pass if you have pieces to place.",
        "MOVES_NOPIECE": "You don't have a {{piece}} piece to place.",
        "MOVES_SYNTAX": "Invalid move syntax. Enter the size followed by the cell (e.g., 3e4)."
    },
    "homeworlds": {
        "CMD_ATK_OWNER": "In games with more than two players, you have to always specify the owner of the ship you are attacking.",
        "CMD_ATK_SELF": "You may not attack yourself.",
        "CMD_ATK_SIZE": "You don't have a ship large enough to attack the ship {{target}}.",
        "CMD_BUILD_TEMPLATE": "You do not have a model from which to build a new ship.",
        "CMD_CATA_ACTIONS": "You may not trigger a catastrophe while you still have actions to use.",
        "CMD_CATA_INVALID": "There is no overpopulation of {{colour}} in the {{system}} system.",
        "CMD_DISC_DOUBLE": "A system by the name {{name}} has already been charted.",
        "CMD_HOME_COLOURS": "You're requesting a home world with fewer than three technologies available. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_DOUBLE": "You already have a home world.",
        "CMD_HOME_RHO": "You're requesting a home world with the same star sizes as your right-hand opponent. This puts your nemesis only one jump away from you! If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_SAMESIZE": "You're requesting a home world with two stars of the same size. This puts you at a strong disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_SINGLE": "You're requesting a home world with only one star. This puts you at a strong disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_SMALLSHIP": "You are requesting a home world without a large ship. This puts you at a disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_HOME_TECHS": "You're requesting a home world that does not contain Green or Blue technologies. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
        "CMD_MOVE_CONNECTION": "The systems {{from}} and {{to}} are not connected. You can only travel between systems that do not share any of the same-sized stars.",
        "CMD_NOACTIONS": "You have no actions remaining.",
        "CMD_NOACTIONS_B": "You have no more trade actions remaining.",
        "CMD_NOACTIONS_G": "You have no construction actions remaining.",
        "CMD_NOACTIONS_R": "You do not have any attack actions remaining.",
        "CMD_NOACTIONS_Y": "You have no movement actions remaining.",
        "CMD_NOSYSTEM": "Could not find a system with the name {{system}}.",
        "CMD_NOTECH_B": "You do not have access to refurbishers (BLUE) in this system.",
        "CMD_NOTECH_G": "You do not have access to shipyards (GREEN) in this system.",
        "CMD_NOTECH_R": "You do not have access to weapons technology (RED) in this system.",
        "CMD_NOTECH_Y": "You do not have access to propulsion technology (YELLOW) in this system.",
        "CMD_PARAMETERS": "The wrong number of parameters were provided.",
        "CMD_PASS_FREE": "You may not pass your free action.",
        "CMD_PASS_TOOMANY": "You tried to pass more actions than you have remaining.",
        "CMD_STARSHIP_NAME": "The following ship/star designation could not be understood: {{arg}}.",
        "CMD_TRADE_DOUBLE": "You can't trade a ship for one of the same colour.",
        "MOVE_MOREACTIONS": "You still have actions to spend.",
        "MOVE_SELFELIMINATE": "You may not eliminate yourself.",
        "MOVE_UNRECOGNIZED": "Unrecognized command: {{cmd}}.",
        "STASH_EMPTY": "The stash has no more {{colour}} pieces left.",
        "SYSTEM_BADNAME": "The system name you requested ({{name}}) is invalid. Names may be no longer than 25 characters, must start with a letter or a number, and may only contain numbers, letters, hyphens, and underscores. No spaces are allowed.",
        "SYSTEM_FULL": "The {{system}} system is full. Home systems can only accommodate 16 ships. Periphery systems can accommodate 24.",
        "SYSTEM_NOSHIP": "Could not find the ship {{ship} in the {{system}} system."
    },
    "INITIAL_UNDO": "You can't undo the initial starting position of the game.",
    "MOVES_GAMEOVER": "You cannot make moves in concluded games",
    "MOVES_INVALID": "The move '{{move}}' is invalid. Please check the rules and try again.",
    "MOVES_OCCUPIED": "The cell {{cell}} is already occupied.",
    "MOVES_SIMULTANEOUS_PARTIAL": "In simultaneous games, both players' moves must be submitted at the same time.",
    "validation": {
        "_general": {
            "DEFAULT_HANDLER": "This is the default handler and should never be called directly. Please inform the administrator.",
            "GENERIC": "A generic error occured while processing your click:\nError message: {{emessage}}\nMove: {{move}}, Row: {{row}}, Col: {{col}}, Index: {{index}}",
            "INVALIDCELL": "Could not find the cell {{cell}} on the board.",
            "NONEXISTENT": "Trying to move a piece or stack that doesn't exist at {{where}}.",
            "NOPIECES": "You have no pieces to place."
        },
        "abande": {
            "DISCONNECTEDMOVE": "A move from {{from}} to {{to}} would disconnect the band.",
            "DISCONNECTEDPLACE": "Placing a piece at {{where}} would disconnect the band.",
            "MOVE2CONTROLLED": "You cannot capture your own stacks.",
            "MOVE2EMPTY": "You cannot move to empty spaces.",
            "PARTIAL": "It's possible you're trying to move a stack. Click on the destination.",
            "TOOEARLY": "You cannot move until the second player has placed two pieces.",
            "TOOHIGH": "Moving from {{from}} to {{to}} would result in a stack taller than three pieces high.",
            "TRIPLESTACK": "You cannot move triple stacks.",
            "UNCONTROLLED": "You cannot move stacks you don't control."
        }
    },
    "volcano": {
        "MOVES_AFTER_ERUPTION": "You may not continue moving after causing an eruption.",
        "MOVES_CAPS_ONLY": "You may only move caps.",
        "MOVES_DOUBLE_CAP": "Nothing may be placed on top of a cap.",
        "MOVES_MUST_ERUPT": "You must continue moving until you cause an eruption.",
        "MOVES_NOPIECE": "You don't have a {{piece}} piece in your stash to place.",
        "MOVES_ONE_POWERPLAY": "You may only make one power play per turn.",
        "MOVES_ONE_SPACE": "Caps may only be moved one space at a time.",
        "MOVES_TOO_FAR": "Caps may only be moved one space at a time."
    }
}
