{
    "blam": {
        "MOVES_NOPASS": "[FRYou may not pass if you have pieces to place.",
        "MOVES_NOPIECE": "[FRYou don't have a {{piece}} piece to place.",
        "MOVES_SYNTAX": "[FRInvalid move syntax. Enter the size followed by the cell (e.g., 3e4)."
    },
    "CMD_ATK_OWNER": "[FRIn games with more than two players, you have to always specify the owner of the ship you are attacking.",
    "CMD_ATK_SELF": "[FRYou may not attack yourself.",
    "CMD_ATK_SIZE": "[FRYou don't have a ship large enough to attack the ship {{target}}.",
    "CMD_BUILD_TEMPLATE": "[FRYou do not have a model from which to build a new ship.",
    "CMD_CATA_ACTIONS": "[FRYou may not trigger a catastrophe while you still have actions to use.",
    "CMD_CATA_INVALID": "[FRThere is no overpopulation of {{colour}} in the {{system}} system.",
    "CMD_DISC_DOUBLE": "[FRA system by the name {{name}} has already been charted.",
    "CMD_HOME_COLOURS": "[FRYou're requesting a home world with fewer than three technologies available. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
    "CMD_HOME_DOUBLE": "[FRYou already have a home world.",
    "CMD_HOME_RHO": "[FRYou're requesting a home world with the same star sizes as your right-hand opponent. This puts your nemesis only one jump away from you! If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
    "CMD_HOME_SAMESIZE": "[FRYou're requesting a home world with two stars of the same size. This puts you at a strong disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
    "CMD_HOME_SINGLE": "[FRYou're requesting a home world with only one star. This puts you at a strong disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
    "CMD_HOME_SMALLSHIP": "[FRYou are requesting a home world without a large ship. This puts you at a disadvantage. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
    "CMD_HOME_TECHS": "[FRYou're requesting a home world that does not contain Green or Blue technologies. This is almost never wise. If you're sure you want to do this, resubmit the command and put an asterisk (*) at the end of it.",
    "CMD_MOVE_CONNECTION": "[FRThe systems {{from}} and {{to}} are not connected. You can only travel between systems that do not share any of the same-sized stars.",
    "CMD_NOACTIONS": "[FRYou have no actions remaining.",
    "CMD_NOACTIONS_B": "[FRYou have no more trade actions remaining.",
    "CMD_NOACTIONS_G": "[FRYou have no construction actions remaining.",
    "CMD_NOACTIONS_R": "[FRYou do not have any attack actions remaining.",
    "CMD_NOACTIONS_Y": "[FRYou have no movement actions remaining.",
    "CMD_NOSYSTEM": "[FRCould not find a system with the name {{system}}.",
    "CMD_NOTECH_B": "[FRYou do not have access to refurbishers (BLUE) in this system.",
    "CMD_NOTECH_G": "[FRYou do not have access to shipyards (GREEN) in this system.",
    "CMD_NOTECH_R": "[FRYou do not have access to weapons technology (RED) in this system.",
    "CMD_NOTECH_Y": "[FRYou do not have access to propulsion technology (YELLOW) in this system.",
    "CMD_PARAMETERS": "[FRThe wrong number of parameters were provided.",
    "CMD_PASS_FREE": "[FRYou may not pass your free action.",
    "CMD_PASS_TOOMANY": "[FRYou tried to pass more actions than you have remaining.",
    "CMD_STARSHIP_NAME": "[FRThe following ship/star designation could not be understood: {{arg}}.",
    "CMD_TRADE_DOUBLE": "[FRYou can't trade a ship for one of the same colour.",
    "INITIAL_UNDO": "[FRYou can't undo the initial starting position of the game.",
    "MOVE_MOREACTIONS": "[FRYou still have actions to spend.",
    "MOVE_SELFELIMINATE": "[FRYou may not eliminate yourself.",
    "MOVE_UNRECOGNIZED": "[FRUnrecognized command: {{cmd}}.",
    "MOVES_GAMEOVER": "[FRYou cannot make moves in concluded games",
    "MOVES_INVALID": "[FRThe move '{{move}}' is invalid. Please check the rules and try again.",
    "MOVES_OCCUPIED": "[FRThe cell {{cell}} is already occupied.",
    "MOVES_SIMULTANEOUS_PARTIAL": "[FRIn simultaneous games, both players' moves must be submitted at the same time.",
    "STASH_EMPTY": "[FRThe stash has no more {{colour}} pieces left.",
    "SYSTEM_BADNAME": "[FRThe system name you requested ({{name}}) is invalid. Names may be no longer than 25 characters, must start with a letter or a number, and may only contain numbers, letters, hyphens, and underscores. No spaces are allowed.",
    "SYSTEM_FULL": "[FRThe {{system}} system is full. Home systems can only accommodate 16 ships. Periphery systems can accommodate 24.",
    "SYSTEM_NOSHIP": "[FRCould not find the ship {{ship} in the {{system}} system.",
    "volcano": {
        "MOVES_AFTER_ERUPTION": "[FRYou may not continue moving after causing an eruption.",
        "MOVES_CAPS_ONLY": "[FRYou may only move caps.",
        "MOVES_DOUBLE_CAP": "[FRNothing may be placed on top of a cap.",
        "MOVES_MUST_ERUPT": "[FRYou must continue moving until you cause an eruption.",
        "MOVES_NOPIECE": "[FRYou don't have a {{piece}} piece in your stash to place.",
        "MOVES_ONE_POWERPLAY": "[FRYou may only make one power play per turn.",
        "MOVES_ONE_SPACE": "[FRCaps may only be moved one space at a time.",
        "MOVES_TOO_FAR": "[FRCaps may only be moved one space at a time."
    }
}
